#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖 Success! The configuration is valid.
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
random_string.af-sa-name-noise: Refreshing state... [id=z4gtem6edd]
random_string.af-name-noise: Refreshing state... [id=JQ31M]
random_password.af-sp-random-password: Refreshing state... [id=none]
azuread_application.af-application: Refreshing state... [id=a8010629-0ebd-4f4c-8550-1058f351d3a2]
azuread_service_principal.af-sp: Refreshing state... [id=3a5f7726-9295-4c1e-ad35-ceb2acfba703]
azuread_service_principal_password.af-sp-random-password: Refreshing state... [id=3a5f7726-9295-4c1e-ad35-ceb2acfba703/password/00633a45-9aeb-de34-8796-6f121e9c67f7]
azurerm_resource_group.af-rg: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg]
azurerm_app_service_plan.af-service-plan: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Web/serverfarms/example-service-plan]
azurerm_storage_account.af-sa: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Storage/storageAccounts/examplesaz4gtem6edd]
azurerm_function_app.af: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Web/sites/pr-1-hello-medium-JQ31M]
azurerm_role_assignment.af-sp-role-assignment: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Web/sites/pr-1-hello-medium-JQ31M/providers/Microsoft.Authorization/roleAssignments/a793d71a-2deb-1f3c-75cd-970a36cbb764]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application.af-application will be updated in-place
  ~ resource "azuread_application" "af-application" {
        id                         = "a8010629-0ebd-4f4c-8550-1058f351d3a2"
      ~ name                       = "af-application" -> "continuous-validation-af-application"
        # (13 unchanged attributes hidden)
    }

  # azurerm_app_service_plan.af-service-plan must be replaced
-/+ resource "azurerm_app_service_plan" "af-service-plan" {
      ~ id                           = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Web/serverfarms/example-service-plan" -> (known after apply)
      - is_xenon                     = false -> null
      ~ kind                         = "functionapp" -> "FunctionApp"
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ maximum_number_of_workers    = 0 -> (known after apply)
      ~ name                         = "example-service-plan" -> "continuous-validation-service-plan" # forces replacement
      - per_site_scaling             = false -> null
      - reserved                     = false -> null
      ~ resource_group_name          = "example-rg" -> "continuous-validation-rg" # forces replacement
      - tags                         = {} -> null
        # (1 unchanged attribute hidden)

      ~ sku {
          ~ capacity = 0 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_function_app.af must be replaced
-/+ resource "azurerm_function_app" "af" {
      ~ app_service_plan_id            = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Web/serverfarms/example-service-plan" -> (known after apply)
      ~ client_affinity_enabled        = false -> (known after apply)
      ~ custom_domain_verification_id  = "BBCBEBEDC9CC07B90BAB0B7B16B5F0B85F00829EEC76431270325414D7DBD6BC" -> (known after apply)
      - daily_memory_time_quota        = 0 -> null
      ~ default_hostname               = "pr-1-hello-medium-jq31m.azurewebsites.net" -> (known after apply)
      ~ id                             = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Web/sites/pr-1-hello-medium-JQ31M" -> (known after apply)
      ~ kind                           = "functionapp" -> (known after apply)
      ~ name                           = "pr-1-hello-medium-JQ31M" -> "pr-1-continuous-validation-JQ31M" # forces replacement
      ~ outbound_ip_addresses          = "20.54.120.126,20.54.125.25,20.54.125.33,20.54.125.100,20.54.125.113,20.54.125.169" -> (known after apply)
      ~ possible_outbound_ip_addresses = "20.54.120.126,20.54.125.25,20.54.125.33,20.54.125.100,20.54.125.113,20.54.125.169,20.54.120.159,20.54.123.124,20.54.123.217,20.54.107.168,20.54.124.67,20.54.124.84,20.54.125.189,20.54.125.211,20.54.125.225,20.54.126.8,20.54.126.10,20.54.126.71,20.54.126.125,20.54.123.87,20.54.126.132,20.54.126.139,20.54.126.149,20.54.126.171,20.54.106.213,20.54.126.194,20.54.127.9,20.54.7.245,20.54.7.252,20.54.7.255" -> (known after apply)
      ~ resource_group_name            = "example-rg" -> "continuous-validation-rg" # forces replacement
      ~ site_credential                = [
          - {
              - password = "5jTxW0zCozQvKpPz95lFwMed8gdBjmnAYPtr6aLBoAjcTj5dkK8J6lN1ptA7"
              - username = "$pr-1-hello-medium-JQ31M"
            },
        ] -> (known after apply)
      ~ storage_account_access_key     = (sensitive value)
      ~ storage_account_name           = "examplesaz4gtem6edd" -> "cvsaz4gtem6edd" # forces replacement
      ~ storage_connection_string      = (sensitive value)
      - tags                           = {} -> null
        # (6 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ site_config {
          ~ always_on                   = false -> (known after apply)
          + auto_swap_slot_name         = (known after apply)
          ~ ftps_state                  = "AllAllowed" -> (known after apply)
          + health_check_path           = (known after apply)
          ~ http2_enabled               = false -> (known after apply)
          ~ ip_restriction              = [] -> (known after apply)
          + linux_fx_version            = (known after apply)
          ~ min_tls_version             = "1.2" -> (known after apply)
          ~ pre_warmed_instance_count   = 0 -> (known after apply)
          ~ scm_ip_restriction          = [] -> (known after apply)
          + scm_type                    = (known after apply)
          ~ scm_use_main_ip_restriction = false -> (known after apply)
          ~ use_32_bit_worker_process   = true -> (known after apply)
          ~ websockets_enabled          = false -> (known after apply)

          ~ cors {
              ~ allowed_origins     = [
                  - "https://functions-next.azure.com",
                  - "https://functions-staging.azure.com",
                  - "https://functions.azure.com",
                ] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "master" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          + repo_url           = (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }
    }

  # azurerm_resource_group.af-rg must be replaced
-/+ resource "azurerm_resource_group" "af-rg" {
      ~ id       = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg" -> (known after apply)
      ~ name     = "example-rg" -> "continuous-validation-rg" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_role_assignment.af-sp-role-assignment must be replaced
-/+ resource "azurerm_role_assignment" "af-sp-role-assignment" {
      ~ id                               = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Web/sites/pr-1-hello-medium-JQ31M/providers/Microsoft.Authorization/roleAssignments/a793d71a-2deb-1f3c-75cd-970a36cbb764" -> (known after apply)
      ~ name                             = "a793d71a-2deb-1f3c-75cd-970a36cbb764" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ role_definition_name             = "Contributor" -> "contributor"
      ~ scope                            = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Web/sites/pr-1-hello-medium-JQ31M" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.af-sa must be replaced
-/+ resource "azurerm_storage_account" "af-sa" {
      ~ access_tier                      = "Hot" -> (known after apply)
      ~ id                               = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/example-rg/providers/Microsoft.Storage/storageAccounts/examplesaz4gtem6edd" -> (known after apply)
      + large_file_share_enabled         = (known after apply)
      ~ name                             = "examplesaz4gtem6edd" -> "cvsaz4gtem6edd" # forces replacement
      ~ primary_access_key               = (sensitive value)
      ~ primary_blob_connection_string   = (sensitive value)
      ~ primary_blob_endpoint            = "https://examplesaz4gtem6edd.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                = "examplesaz4gtem6edd.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string        = (sensitive value)
      ~ primary_dfs_endpoint             = "https://examplesaz4gtem6edd.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                 = "examplesaz4gtem6edd.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint            = "https://examplesaz4gtem6edd.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                = "examplesaz4gtem6edd.file.core.windows.net" -> (known after apply)
      ~ primary_location                 = "northeurope" -> (known after apply)
      ~ primary_queue_endpoint           = "https://examplesaz4gtem6edd.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host               = "examplesaz4gtem6edd.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint           = "https://examplesaz4gtem6edd.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host               = "examplesaz4gtem6edd.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint             = "https://examplesaz4gtem6edd.z16.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                 = "examplesaz4gtem6edd.z16.web.core.windows.net" -> (known after apply)
      ~ resource_group_name              = "example-rg" -> "continuous-validation-rg" # forces replacement
      ~ secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      ~ secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      - tags                             = {} -> null
        # (8 unchanged attributes hidden)

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }
    }

Plan: 5 to add, 1 to change, 5 to destroy.

Changes to Outputs:
  ~ azure-function-name = "pr-1-hello-medium-JQ31M" -> "pr-1-continuous-validation-JQ31M"

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @MartinAnder, Action: `pull_request`, Working Directory: ``, Workflow: `Up`*